<a href="https://colab.research.google.com/github/tim530712345/20210615/blob/main/titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
from urllib.request import urlretrieve
url = "https://github.com/Elwing-Chou/ml0602/raw/main/titanic/train.csv"
urlretrieve(url, "train.csv")
url = "https://github.com/Elwing-Chou/ml0602/raw/main/titanic/test.csv"
urlretrieve(url, "test.csv")

('test.csv', <http.client.HTTPMessage at 0x7f9f4b65ee10>)

In [3]:
import pandas as pd
train_df = pd.read_csv("train.csv", encoding="utf-8")
test_df = pd.read_csv("test.csv", encoding="utf-8")

In [4]:
test_df

     PassengerId  Pclass  ... Cabin Embarked
0            892       3  ...   NaN        Q
1            893       3  ...   NaN        S
2            894       2  ...   NaN        Q
3            895       3  ...   NaN        S
4            896       3  ...   NaN        S
..           ...     ...  ...   ...      ...
413         1305       3  ...   NaN        S
414         1306       1  ...  C105        C
415         1307       3  ...   NaN        S
416         1308       3  ...   NaN        S
417         1309       3  ...   NaN        C

[418 rows x 11 columns]

In [ ]:
data = pd.concat([train_df,test_df], ignore_index=True) # 重新列標號
data = data.drop(['PassengerId','Survived'], axis=1)
data

In [16]:
na = data.isna().sum() # 顯示是否為空值 用sum可以檢查出多少是1或0
# 對series做篩選 Series[帶入跟你的資料筆數一樣多的True/False list]
na[na > 0].sort_values(ascending=False) #na[na > 0] 將大於0的顯示出來,sort_values 做排序，ascending=False 大到小排序

Cabin       1014
Age          263
Embarked       2
Fare           1
dtype: int64

In [ ]:
s = pd.Series([1,2,3])
#def func(n):
 # return n*n
#s.apply(n)
s.apply(lambda n:n*n) # lambda 無名函式 將上述的def寫成一行

In [27]:
def cabin_head(s):
  if not pd.isna(s):
    return s[0]
data['Cabin'] = data['Cabin'].apply(cabin_head)

In [26]:
dic = data['Ticket'].value_counts()
data['Ticket'] = data['Ticket'].apply(lambda t:dic[t])